huygithcm/code_tung/esp32_car/src/main.cpp
// Lay mau gyro va cong don goc. Tu gioi han ~250Hz.
void updateGyro() {
  if (!mpuOK) return;
  unsigned long now = micros();
  float dt = (now - lastGyroUs) * 1e-6f;
  if (dt < 0.004f) return;                 // toi da ~250Hz
  lastGyroUs = now;
  if (dt > 0.2f) return;                   // nhip qua dai -> bo (tranh nhay goc)
  float dps = (mpuGyroZraw() - gyroBiasZ) / GYRO_LSB_PER_DPS;
  gyroDelta += GYRO_SIGN * dps * dt * PI / 180.0f;   // rad
}

// ===================== Odometry =====================
// Cap nhat toa do (x,y,theta): quang duong tu encoder, GOC hop nhat encoder + gyro.
void updateOdometry() {
  updateGyro();                                // lay mau gyro (tu gioi han nhip)
  long l = encL, r = encR;
  long dL = l - lastOdoL;
  long dR = r - lastOdoR;
  lastOdoL = l; lastOdoR = r;
  float dThetaGyro = gyroDelta; gyroDelta = 0;  // tieu thu goc gyro da cong don
  if (dL == 0 && dR == 0 && fabsf(dThetaGyro) < 1e-6f) return;

  float mmPerPulse = (PI * WHEEL_DIAMETER_MM) / ENCODER_PPR;
  float sL = dL * mmPerPulse;
  float sR = dR * mmPerPulse;
  float dS = (sL + sR) * 0.5f;                 // quang duong tam xe
  float dThetaEnc = (sR - sL) / WHEEL_BASE_MM; // goc theo encoder (sai khi truot banh)
  // Hop nhat: tin gyro nhieu hon (khong bi truot), encoder chong troi dai han
  float dTheta = mpuOK ? (GYRO_W * dThetaGyro + (1.0f - GYRO_W) * dThetaEnc) : dThetaEnc;

  // tich phan vi tri (dung huong giua doan de chinh xac hon)
  poseX += dS * cosf(poseTheta + dTheta * 0.5f);
  poseY += dS * sinf(poseTheta + dTheta * 0.5f);
  poseTheta += dTheta;
}

void resetOdometry() {
  encL = 0; encR = 0; lastOdoL = 0; lastOdoR = 0;
  poseX = poseY = poseTheta = 0;
  gyroDelta = 0; lastGyroUs = micros();   // bo goc gyro con ton dong
}

// In toa do hien tai
void printPose() {
  Serial.printf("[pose] x=%.1fmm  y=%.1fmm  theta=%.1f deg  (encL=%ld encR=%ld)\n",
                poseX, poseY, poseTheta * 180.0f / PI, encL, encR);
}

// ===================== Tinh sai so line =====================
// Tra ve TRUE neu thay line. Cap nhat lineError (am=line lech trai, duong=phai).
// Den = gia tri THAP -> mat thay line khi raw < nguong.
bool computeLineError() {
  readLine();
  // trong so vi tri C1..C8: -3.5 .. +3.5 (giua C4-C5 = 0)
  static const float W[8] = {-3.5,-2.5,-1.5,-0.5, 0.5, 1.5, 2.5, 3.5};
  float sum = 0; int cnt = 0;
  for (int i = 0; i < 8; i++) {
    if (!SENSOR_OK[i]) continue;                   // bo qua mat hong
    int th = lineCalibrated ? lineThresh[i] : LINE_THRESHOLD;
    if (lineRaw[i] < th) { sum += W[i]; cnt++; }   // mat thay vach den
  }
  lineCount = cnt;
  if (cnt == 0) { lineLost = true; return false; } // mat line
  lineLost = false;
  // Tru LINE_TRIM de dua TAM THAT ve 0. Can thiet vi C1 bi mask -> mang dung duoc
  // la C2..C8, tam hinh hoc cua no o +0.5 chu khong phai 0; cong them sai lech
  // co khi gan thanh cam bien. Khong tru -> xe luon be lech 1 ben.
  lineError = sum / cnt - LINE_TRIM;
  return true;
}

// Chi phan PID + xuat dong co (gia dinh computeLineError() vua tra TRUE).
void lineDrivePID() {
  errIntegral += lineError;
  errIntegral = constrain(errIntegral, -50, 50);
  float d = lineError - lastError;
  float correction = Kp * lineError + Ki * errIntegral + Kd * d;
  lastError = lineError;
  int left  = baseSpeed - (int)correction;   // line lech phai (error>0) -> phai nhanh hon, xe re phai
  int right = baseSpeed + (int)correction;
  driveA(left); driveB(right);
}

// ===================== Vong dieu khien bam line (che do THU CONG 'g') =====================
void lineFollowStep() {
  if (!computeLineError()) {
    // Mat line: quay tai cho theo huong lech cuoi cung de tim lai.
    // Dung TURN_OPEN_PWM (khong phai baseSpeed): quay tai cho doi ma sat tinh lon hon
    // chay thang nhieu. Neu baseSpeed bi chinh thap (de bam line em) se khong du
    // luc xoay -> banh truot/ket tai cho nhung encoder van dem -> odom troi sai.
    int dir = (lastError >= 0) ? 1 : -1;
    int spd = max(baseSpeed, TURN_OPEN_PWM);
    driveA(-dir * spd); driveB(dir * spd);
    return;
  }
  lineDrivePID();
}

// ===================== Re theo GOC (gyro feedback) =====================
// Quay tai cho mot goc tuong doi (deg). Duong = quay trai (CCW), am = phai.
// CACH LAM (khong phu thuoc pin): chay PWM co dinh, doc GOC THAT (poseTheta, hop nhat gyro)
// lien tuc, DUNG NGAY khi da quay du (|goc| >= |deg| - TURN_LEAD_DEG). TURN_LEAD_DEG bu phan
// xe con truot them sau khi cat dien. KHONG servo/sua lui -> quay 1 lan roi thoi, khong lac.
// Neu KHONG co gyro -> fallback open-loop theo thoi gian (ms/do) nhu truoc.
void turnRelative(float deg) {
  if (fabs(deg) < 0.5f) return;
  float startTheta = poseTheta;
  int sgn = INVERT_TURN ? -1 : 1;
  int dir = (deg >= 0) ? 1 : -1;
  unsigned long t0 = millis();
  bool timedOut = false;

  driveA(sgn * dir * TURN_OPEN_PWM); driveB(-sgn * dir * TURN_OPEN_PWM);  // quay tai cho: 2 banh nguoc chieu

  if (mpuOK) {
    // --- Dung theo GOC THAT (khong phu thuoc pin) ---
    float targetAbs = fabs(deg) - TURN_LEAD_DEG;
    if (targetAbs < fabs(deg) * 0.5f) targetAbs = fabs(deg) * 0.5f;   // goc nho: it nhat quay nua goc
    while (true) {
      updateOdometry();
      float progAbs = fabs(poseTheta - startTheta) * 180.0f / PI;      // goc DA quay (do)
      if (progAbs >= targetAbs) break;
      if (millis() - t0 > (unsigned long)TURN_TIMEOUT_MS) { timedOut = true; break; }
      delay(2);
    }
  } else {
    // --- Fallback: khong co gyro -> chay theo thoi gian (ms/do), rieng trai/phai ---
    float offset = (deg >= 0) ? TURN_MS_OFFSET_L  : TURN_MS_OFFSET_R;
    float perDeg = (deg >= 0) ? TURN_MS_PER_DEG_L : TURN_MS_PER_DEG_R;
    unsigned long ms = (unsigned long)(offset + fabs(deg) * perDeg + 0.5f);
    while (millis() - t0 < ms) { updateOdometry(); delay(2); }
  }
  stopMotors();

  // Cho dung han + do lai goc that de ghi log (xe con truot 1 chut sau khi cat dien)
  delay(120);
  updateOdometry();
  float achievedDeg = (poseTheta - startTheta) * 180.0f / PI;
  char res[150];
  snprintf(res, sizeof(res),
    "[turnres] tgt=%.1f dat=%.2f err=%.2f ms=%lu (%s, pwm=%d)",
    deg, achievedDeg, deg - achievedDeg, millis() - t0,
    mpuOK ? (timedOut ? "gyro-TIMEOUT" : "gyro") : "thoi-gian", TURN_OPEN_PWM);
  hubLog(res);
}

// ===================== Tien ich =====================
// Phat tone tan so freq (Hz) trong ms mili-giay
void buzzerTone(int freq, int ms) {
  ledcSetup(BUZZER_CH, freq, 8);
  ledcAttachPin(BUZZER, BUZZER_CH);
  ledcWrite(BUZZER_CH, 128);   // 50% duty
  delay(ms);
  ledcWrite(BUZZER_CH, 0);
}
void beep(int ms) { buzzerTone(2000, ms); }

