huygithcm/code_tung/esp32_car/src/main.cpp
    // ----- Do line (MUX) -----
    case 'm': streamLine = true;  Serial.println("Stream 8 mat: ON"); break;
    case 'M': streamLine = false; Serial.println("Stream 8 mat: OFF"); break;
    case 'n': printLine(); break;
    case 'c': calibrateLine(); break;

    // ----- Bam line PID -----
    case 'g':
      lineFollow = true; lastError = 0; errIntegral = 0;
      Serial.println("BAM LINE: ON");
      break;
    case 'B': baseSpeed = constrain(cmd.substring(1).toInt(), 0, 255);
              Serial.printf("baseSpeed = %d\n", baseSpeed); break;
    case 'k':
      if (cmd.startsWith("kp")) { Kp = cmd.substring(2).toFloat(); Serial.printf("Kp=%.2f\n", Kp); }
      else if (cmd.startsWith("ki")) { Ki = cmd.substring(2).toFloat(); Serial.printf("Ki=%.2f\n", Ki); }
      else if (cmd.startsWith("kd")) { Kd = cmd.substring(2).toFloat(); Serial.printf("Kd=%.2f\n", Kd); }
      else Serial.println("Dung: kp.. / ki.. / kd..");
      break;

    // ----- Cau hinh mang (WiFi + IP hub) -----
    // Wn<ten>  = dat ten WiFi     Wp<mk> = dat mat khau
    // Wh<ip>   = dat IP laptop/hub Ws     = luu NVS + ket noi lai
    // W        = xem cau hinh hien tai
    case 'W': {
      if (cmd.length() == 1) {
        Serial.printf("SSID='%s'  PASS='%s'  HUB=%s:%d\n",
                      cfgSsid.c_str(), cfgPass.c_str(), cfgHub.c_str(), HUB_PORT);
        break;
      }
      char sub = cmd.charAt(1);
      String val = cmd.substring(2); val.trim();
      if (sub == 'n')      { cfgSsid = val; Serial.printf("SSID = '%s'\n", cfgSsid.c_str()); }
      else if (sub == 'p') { cfgPass = val; Serial.printf("PASS = '%s'\n", cfgPass.c_str()); }
      else if (sub == 'h') { cfgHub  = val; Serial.printf("HUB  = %s\n", cfgHub.c_str()); }
      else if (sub == 's') {
        saveNetConfig();
        Serial.println(F(">> Ket noi lai voi cau hinh moi..."));
        WiFi.disconnect(); wifiOK = false; hubOK = false;
        setupWiFi();          // -> onWifiUp() tu bat web + hub + OTA
      }
      else Serial.println(F("Dung: Wn<ten> / Wp<mk> / Wh<ip> / Ws (luu+ket noi) / W (xem)"));
      break;
    }

    // ----- Khac -----
    case 'z': beep(150); Serial.println("Beep"); break;
    case '?': printMenu(); break;
    default:  Serial.printf("Lenh khong hieu: '%s' (go ? de xem menu)\n", cmd.c_str());
  }
}

// ===================== Web server =====================
const char PAGE_HTML[] PROGMEM = R"HTML(
<!DOCTYPE html><html lang="vi"><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>ESP32 Car</title>
<style>
 body{font-family:system-ui,sans-serif;text-align:center;background:#111;color:#eee;margin:0;padding:20px}
 h1{font-size:1.4em}
 button{font-size:1.6em;padding:22px 0;width:80%;margin:12px 0;border:0;border-radius:14px;color:#fff;font-weight:700}
 .start{background:#1e9e54}.stop{background:#c0392b}
 #st{font-size:1.1em;margin-top:18px;line-height:1.7em}
 .on{color:#2ecc71}.off{color:#e74c3c}
</style></head><body>
<h1>🚗 ESP32 Car — Bám line</h1>
<button class="start" onclick="cmd('start')">▶ START</button>
<button class="stop" onclick="cmd('stop')">■ STOP</button>
<div id="st">...</div>
<script>
 function cmd(c){fetch('/'+c).then(()=>upd())}
 function upd(){fetch('/status').then(r=>r.json()).then(s=>{
   document.getElementById('st').innerHTML=
    'Trạng thái: <b class="'+(s.run?'on':'off')+'">'+(s.run?'ĐANG CHẠY':'DỪNG')+'</b><br>'+
    'err='+s.err.toFixed(2)+(s.lost?' ⚠️ MẤT LINE':'')+'<br>'+
    'x='+s.x+' y='+s.y+' θ='+s.th+'°';
 }).catch(()=>{})}
 setInterval(upd,400);upd();
</script></body></html>
)HTML";

void handleRoot()   { server.send_P(200, "text/html", PAGE_HTML); }
void handleStart()  { lineFollow = true; lastError = 0; errIntegral = 0;
                      Serial.println("[web] START bam line");
                      server.send(200, "text/plain", "started"); }
void handleStop()   { lineFollow = false; stopMotors();
                      Serial.println("[web] STOP");
                      server.send(200, "text/plain", "stopped"); }
void handleStatus() {
  char buf[160];
  snprintf(buf, sizeof(buf),
    "{\"run\":%d,\"err\":%.2f,\"lost\":%d,\"x\":%.0f,\"y\":%.0f,\"th\":%.0f}",
    lineFollow ? 1 : 0, lineError, lineLost ? 1 : 0,
    poseX, poseY, poseTheta * 180.0f / PI);
  server.send(200, "application/json", buf);
}

// ===================== DIEU PHOI: route tu hub =====================
// Gui trang thai xe ve hub (khop {status,node,pos,cargo} ma server.js cho).
// Frame odometry TRUNG frame map (HOME=(0,0), nhin +x=0deg) nen gui thang pose.
void sendTelemetry() {
  if (!hubOK) return;
  const char* st = running ? (cargo ? "moving" : "arrived") : "idle";
  char node[16];
  if (routeTarget.length()) snprintf(node, sizeof(node), "\"%s\"", routeTarget.c_str());
  else strcpy(node, "null");
  char buf[176];
  snprintf(buf, sizeof(buf),
    "{\"status\":\"%s\",\"node\":%s,\"pos\":{\"x\":%.0f,\"y\":%.0f,\"th\":%.0f},\"cargo\":%s}",
    st, node, poseX, poseY, poseTheta * 180.0f / PI, cargo ? "true" : "false");
  wsClient.sendTXT(buf);
}

// In log ra Serial VA day len hub duoi dang {type:"clog",text:...} de web hien thi.
void hubLog(const String& s) {
  Serial.println(s);
  if (!hubOK) return;
  JsonDocument d;
  d["type"] = "clog";
  d["text"] = s;
  String out;
  serializeJson(d, out);
  wsClient.sendTXT(out);
}

// Lai tay F/B/L/R (huy route dang chay). 'S'/khac = dung.
void doManual(const String& dir) {
  running = false; lineFollow = false; routeTarget = "";
  char d = dir.length() ? dir.charAt(0) : 'S';
  int s = motorSpeed;
  // !! PHAN CUNG: chan MA_* thuc te chay banh PHAI, MB_* chay banh TRAI (bi trao khi lap).
  // Da kiem chung: 'F'/'B' khong bi anh huong (2 banh cung chieu);
  // 'L' cu (A=-1,B=+1) lam xe quay PHAI -> phai doi cho L/R.
  // turnRelative va lineFollowStep KHONG sua: chung dung driveA/driveB doi xung nen
  // cai trao nay TU TRIET TIEU (da do: re +90 -> +89.8 do, dung chieu).
  if      (d == 'F') { setMotorA(+1, s); setMotorB(+1, s); }
  else if (d == 'B') { setMotorA(-1, s); setMotorB(-1, s); }
  else if (d == 'L') { setMotorA(+1, s); setMotorB(-1, s); }   // banh phai tien, banh trai lui
  else if (d == 'R') { setMotorA(-1, s); setMotorB(+1, s); }   // banh phai lui, banh trai tien
  else stopMotors();
}

// Tha hang: dung -> ha servo -> beep -> ve goc giu.
void doDrop() {
  stopMotors();
  servo.write(SERVO_DROP);
  cargo = false;
  beep(120);
  delay(400);                 // cho co cau tha xong
  servo.write(SERVO_HOLD);
  hubLog("[drop] Da tha hang");
  sendTelemetry();
}

// Bao 1 buoc da xong (ok/that bai) ve server + dung cho buoc ke.
// HOME (buoc cuoi 1 chuyen) hoac that bai -> ket thuc chuyen (running=false).
void finishStep(bool ok, const String& reason) {
  stopMotors();
  String act = curAction;
  if (act == "HOME" || !ok) { running = false; lineFollow = false; }
  if (act == "HOME") cargo = true;
  if (hubOK) {
    JsonDocument d;
    d["type"] = "stepdone";
    d["seq"] = curSeq;
    d["action"] = act;
    d["ok"] = ok;
    d["reason"] = reason;
    JsonObject p = d["pos"].to<JsonObject>();
    p["x"]  = (int)lroundf(poseX);
    p["y"]  = (int)lroundf(poseY);
    p["th"] = (int)lroundf(poseTheta * 180.0f / PI);
    d["lineCount"] = lineCount;
    String out; serializeJson(d, out);
    wsClient.sendTXT(out);
  }
  // RE-ANCHOR: buoc THANH CONG toi 1 node da biet -> snap odometry ve dung toa do + HUONG node,
  // xoa troi tich luy (xe bam line thuc te dung nhung odometry troi dan). Bao pose THO o tren
  // (server do troi that) roi moi snap. Chi snap khi ok (that bai -> xe khong o node).
  if (ok && curNodeValid) {
    poseX = curNodeX;
    poseY = curNodeY;
    if (curNodeThValid) poseTheta = curNodeTh;   // snap ca HUONG -> xoa troi huong tich luy
  }
  curAction = "";              // idle -> cho server gui buoc ke
  stepPhase = 0;
  sendTelemetry();
}

// Nap 1 buoc tu server va bat dau thuc thi. seq==0 -> chuyen moi (reset odometry tai HOME).
// nodeX/nodeY: toa do node xe se toi (server gui de re-anchor); nodeValid=false -> khong snap.
// nodeTh (rad): huong doan di vao node; nodeThValid=false -> khong snap huong.
void beginStep(const String& action, float dist, int seq, float nodeX, float nodeY, bool nodeValid,
               float nodeTh, bool nodeThValid) {
  if (seq == 0) resetOdometry();     // xe dang o HOME -> xoa troi tich luy
  curAction = action;
  curDist   = dist;
  curSeq    = seq;
  curNodeX = nodeX; curNodeY = nodeY; curNodeValid = nodeValid;
  curNodeTh = nodeTh; curNodeThValid = nodeThValid;
  stepPhase = 0; leftStart = false;
  lastError = 0; errIntegral = 0;
  running = true;
  hubLog("[step] " + String(seq) + ": " + action + (dist > 0 ? (" (" + String((int)dist) + "mm)") : ""));
}

